tutorials/precice/twophase_right/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            patch;
        nFaces          100;
        startFace       23780;
    }
    atmosphere
    {
        type            patch;
        nFaces          100;
        startFace       23880;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       23980;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       24100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24000;
        startFace       24220;
    }
)

// ************************************************************************* //
